title: Week 8 Sigma Rule
id: f62d8927-2614-429c-88dc-97b1988095c8
status: test
description: execution of a test malicious process    
author: Forde Kohler
date: 2024/10/23
logsource:
    category: process_creation
    serviec: sysmon
    product: windows
detection:
    selection:
        -C:\Windows\Microsoft.NET\Framework64\v4.0.30319\InstallUtil.exe /logfile= /logtoconsole=false
        -C:\Users\Administrator\malicious.exe
    condition: selection
falsepositives:
    - Unknown
